-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 03, 2025 at 04:09 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `news_database`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `category_id` int(11) NOT NULL,
  `category_name` varchar(45) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`category_id`, `category_name`) VALUES
(1, 'سیاسی'),
(2, 'فرهنگی و هنری'),
(3, 'اقتصادی'),
(0, 'اجتماعی'),
(0, 'ورزشی');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `comment_id` int(11) NOT NULL,
  `comment_author` int(11) NOT NULL,
  `comment_created_at` datetime NOT NULL,
  `comment_pending` char(1) NOT NULL,
  `comment_article` int(11) NOT NULL,
  `comment_parent` int(11) NOT NULL,
  `comment_content` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `news_id` int(11) NOT NULL,
  `news_title` varchar(45) NOT NULL,
  `news_date` date NOT NULL,
  `news_content` longtext NOT NULL,
  `news_author` int(11) NOT NULL,
  `news_is_visible` char(1) NOT NULL,
  `news_category` int(11) NOT NULL,
  `news_picture` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`news_id`, `news_title`, `news_date`, `news_content`, `news_author`, `news_is_visible`, `news_category`, `news_picture`) VALUES
(6, 'رقم عیدی 1404 کارمندان دولت اعلام شد + جزئیات', '0000-00-00', 'به گزارش اقتصادنیوز به نقل از ایرنا، به گفته فاطمه مهاجرانی بر همین اساس ۳ میلیون تومان به عنوان عیدی و ۸۴۰ هزارتومان حق عائله مندی در نظر گرفته شده است.\r\n\r\nهمچنین به ازای هر فرزند ۳۶۰ هزار تومان در نظر گرفته شده است.', 1, '', 0, 'https://cdn.eghtesadnews.com/thumbnail/qm5H8GFPfJhp/mW4TY_vzMeEG1fqb61-mcCKrGYGcOSm4SW9Yyhl5b2N1qvFeEPKLcFkzrdrrAcG9cg9gAf9kJWJmze2Es8GZhDlkJqwVKQrtv7ORP8RLgsc,/%DA%A9%D8%A7%D8%B1%D9%85%D9%86%D8%AF%D8%A7%D9%86.jpg'),
(11, 'هم‌صدایی تهران و مسکو؛ عربستان و ترکیه به روس', '0000-00-00', 'به گزارش اقتصادنیوز، ریسپانسیبل استیت کرفت با انتشار یادداشتی مدعی شد:‌ ۱۷ ژانویه ولادیمیر پوتین، رئیس‌جمهور روسیه و مسعود پزشکیان، همتای ایرانی‌اش، توافق‌نامه استراتژیک تاریخی ۲۰ ساله را امضا کردند؛ توافقی که به گزارش رویترز غرب را نگران کرد.\r\n\r\nبراساس مفاد این توافق، دو کشور بر افزایش همکاری در خدمات امنیتی، مانور‌های نظامی، بازدید از بندر و آموزش افسران مشترک توافق کردند. آن‌ها متعهد شدند که اجازه ندهند از قلمروشان در هیچ اقدام نظامی علیه دیگری استفاده شود، یا به کسی برای حمله به دیگری کمک کنند و برای مقابله با تهدیدات نظامی خارجی همکاری کنند.\r\n\r\nچرا امضای توافق تهران و مسکو به تعویق افتاد؟\r\nبه نوشته این وبگاه، در ابتدا این گمانه‌زنی وجود داشت که این پیمان در جریان اجلاس سران بریکس در روسیه در ماه اکتبر تصویب خواهد شد، اما مسکو در آن زمان به سرعت این شایعات را رد کرد. با توجه به تلاش‌های مسکو برای فراگیر کردن این اجلاس و عضوگیری بیشتر در جنوب جهانی، احتمالاً روسیه تصمیم به امضای توافقنامه را به بعد موکول کرد؛ چرا که در آن بازه زمانی همکاری تجاری و امنیتی دوجانبه تهران و مسکو، اهداف اصلی اجلاس را تضعیف می‌کرد.\r\n\r\nبه طور خاص، آن اهداف (همچنین زیربنای اساسی مشارکت جدید امضا شده) بر بی‌اعتبار کردن ادعا‌های غرب در مورد انزوای روسیه متمرکز شده و نشان می‌دهد که بریکس قادر است حمایت بازیگران مختلف را از آن خود کند، به ویژه، از منظر ژئواکونومیک، که این بلوک قادر است با تحریم‌های اعمال شده توسط غرب از طریق مختلف مقابله کند.\r\n\r\nتوسعه سیستم‌های پرداخت جدید از جمله مقوله‌هایی است که در توافق استراتژیک بدان اشاره شده که به کشور‌ها اجازه می‌دهد با ارز‌های ملی خود تجارت کنند. در همین راستا پیام وحدت بریکس که به دقت پرورش داده شده، آسیب می‌دید؛ اگر این توافق شرکت‌کنندگان مهمی مانند ترکیه، عربستان سعودی و امارات را که به عنوان قوی‌ترین رقبای تهران شناخته می‌شوند،‌ نادیده می‌گرفت.\r\n\r\nبا این حال، کمتر از دو ماه بعد، دخالت ترکیه در سرنگونی دولت بشار اسد -که مورد حمایت مسکو-تهران بود- و بازی قدرت بعدی آن در شام، امضای رسمی توافق را تسریع کرد. سوریه به وضوح برای پوتین و پزشکیان موضوعی کلیدی بود. بر اساس قرائت کرملین از رایزنی‌های انجام شده، آن‌ها هنگام بحث در مورد تحولات اخیر در سوریه، هر یک بر تعهد خود به یافتن راه حل جامع در این کشور بر اساس احترام به حاکمیت، استقلال و تمامیت ارضی آن تأکید کردند.\r\n\r\nهم‌صدایی برای گسترش دامنه یارکشی\r\nسوریه برای دو بازیگر از اهمیت قابل توجهی برخوردار هستند. به عنوان مثال، در ماده ۱۲ توافق، هر دو طرف تأکید داشتند که همکاری امنیتی روسیه و ایران در آسیای مرکزی، قفقاز جنوبی و خاورمیانه با هدف جلوگیری از مداخله و بی‌ثباتی توسط اشخاص ثالث [کشورها] را تقویت کنند.\r\n\r\nاین تعهد شامل توافق دوجانبه برای نادیده گرفتن تحریم‌های آینده غرب علیه دو کشور است. در کنفرانس مطبوعاتی پس از امضای قرارداد، پوتین تأکید کرد که تضمین صلح و ثبات در این منطقه (که اغلب به عنوان غرب آسیا خوانده می‌شود) در خدمت منافع هر دو کشور است. غرب آسیا نه تنها در زمینه امنیتی برای دو کشور اهمیت دارد، بلکه از نظر همکاری و توسعه تجاری و اقتصادی منطقه نیز اهمیت دارد.\r\n\r\nپوتین در طی سخنانی پس از امضای این قرارداد گفت: «فرصت‌های‌امیدوارکننده‌ای در ارتباط با کریدور حمل‌ونقل بین‌المللی شمال-جنوب در راه است». گفت‌وگو‌ها در مورد ساخت بخش راه‌آهن رشت - آستارا ادامه دارد. اجرای این پروژه به ایجاد یک زنجیره تأمین یکپارچه از روسیه و بلاروس به بنادر ایران در خلیج فارس کمک می‌کند.\r\n\r\nتوسعه کریدور‌ها به گسترش دامنه زنجیره تأمین نه تنها به روسیه و ایران خدمت می‌کند، بلکه سیگنال مهمی را به شریک اصلی یعنی چین جهت تحقق پروژه جاده و کمربند ارسال می‌کند. همچنین پیامی برای بریکس و اعضای بالقوه بریکس است که به دنبال فرصت‌های تجاری و توسعه اقتصادی بیشتر در منطقه هستند.\r\n\r\nدر کنفرانس مطبوعاتی مشترک اعلام شد که دو طرف به نهایی کردن قرارداد ۲ میلیارد متر مکعب در سال برای ارسال گاز روسیه به ایران نزدیک هستند که به طور بالقوه حجم انتقالی را به میزان ۵۵ میلیارد متر مکعب در سال افزایش می‌دهد. دو کشور احتمالاً در بحبوحه تنش‌های فزاینده با غرب و خطر سیاست سخت‌تر تحریم‌های انرژی از سوی دولت آینده ترامپ، به روابط نزدیک‌تر در حوزه انرژی اهمیت می‌دهند.\r\n\r\nاین پروژه همچنین نشان دهنده تعهد روسیه به توسعه شراکت‌ها و مسیر‌های انرژی جدید پس از توقف عرضه گاز روسیه توسط اوکراین است. جریان گاز روسیه از طریق اوکراین به کشور‌های اتحادیه اروپا پس از انقضای یک قرارداد پنج ساله در دسامبر متوقف شده که نشان دهنده پایان یک توافق چند دهه است.', 1, '', 0, 'https://cdn.eghtesadnews.com/servev2/XTtuUjP4PH1x/lLl5vbV5w7c,/1.png'),
(12, 'بزرگترین انتقال تاریخ فوتبال ایران کلید خورد', '0000-00-00', 'رایان کنت در پرسپولیس؛ خبری که در روز‌های گذشته در خروجی رسانه‌های ترکیه قرار گرفت، چندان از سوی هواداران پرسپولیس جدی گرفته نشد، اما حالا به فضای رسانه‌ای بریتانیا هم رسیده و نشریات مهمی، چون سان هم آن را به عنوان یک انتقال احتمالی پوشش داده‌اند.\r\n\r\nکنت که بعد از فسخ با فنرباغچه، به عنوان بازیکن آزاد در دسترس است، در حال مذاکره با پرسپولیس قرار دارد گفته می‌شود که اسماعیل کارتال، سرمربی جدید این تیم نیز، نقش مهمی در متقاعد کردن او داشته است. کارتال که پیش‌تر در فنرباغچه نیز با این وینگر انگلیسی همکاری داشت، قصد دارد با جذب کنت، قدرت هجومی سرخ‌پوشان را افزایش دهد.', 1, '', 0, 'https://cdn.afkarnews.com/thumbnail/xoBymxWy2AKQ/rDxJk2yoXn9KV7c7C6kDwb8gXQLzm0KVkbz182Z_RjPhaRqCI9JPJZezKB80dVNrXTYXaWKO8q0wfYWGdiJBEedZbU5YLDeVWlQuXH7FEGUwWxWQxIu3Fg,,/%D9%BE%D8%B1%D8%B3%D9%BE%D9%88%D9%84%DB%8C%D8%B3.jpg'),
(13, 'از طرف آمریکا زمان مذاکره دیگر به پایان رسیده', '0000-00-00', 'یک کارشناس مسائل بین‌الملل می‌گوید: از طرف آمریکا زمان مذاکره دیگر به پایان رسیده است. ترامپ آماده برای تعامل و معامله است که پشت میزی بنشیند و بگوید شرایط من را که می‌دانید، حالا نظرتان را راجع به این شرایط بگویید و اگر خواستید قبول کنید.\r\n\r\nمهسا مژدهی: ایالات متحده با خروج از برجام در دور اول ریاست‌جمهوری ترامپ، عملا توافق هسته‌ای را با بحران فراوانی روبه‌رو کرد. گفتگوها برای بازگشت ایالات متحده به برجام، در طول سال‌های دولت بایدن به نتیجه نرسید و تهران هم در زمان دولت سیزدهم چندان برای رسیدن به یک توافق مصر به نظر نمی‌رسید. با بازگشت دوباره ترامپ به کاخ سفید، افزایش فشارها بر ایران، نزدیک شدن به تاریخ پایان برجام و امکان فعال شدن مکانیسم ماشه، به نظر می‌رسد ادامه روند فعلی به سود تهران نباشد. از سمت دیگر، ترامپ در پیام‌های ضدونقیضی نشان می‌دهد که از معامله با تهران استقبال می‌کند اما شرایط او ممکن است با آنچه ایران انتظارش را دارد همخوانی نداشته باشد.', 1, '', 0, 'https://media.khabaronline.ir/d/2025/02/03/2/6174717.jpg?ts=1738530079000'),
(14, 'توصیف پایداری حضرت عباس(ع) در بیان امام صادق ', '0000-00-00', 'حضرت ابوالفضل العباس علیه‌السلام چهره درخشان مکتب اسلام و نماد وفاداری، شجاعت و ادب است. ایشان فرزند امیر مؤمنان علی علیه‌السلام و برادر سیدالشهداء امام حسین و امام حسن علیهما السلام بود که در نسب و شرافت، در عالی‌ترین جایگاه قرار داشت. عباس علیه‌السلام با ادب و اخلاق والای خویش، تجلی‌بخش ارزش‌های اصیل اسلامی و الگویی بی‌بدیل برای شیعیان و تمام آزادگان جهان است.\r\n\r\nایشان در واقعه عاشورا، با فداکاری و شجاعت بی‌نظیر خود، وفاداری به امام زمانش را به نمایش گذاشت و در راه دفاع از حق و حقیقت، جان خود را فدا کرد. عباس علیه‌السلام نه تنها در میدان نبرد، که در تمام مراحل زندگی، با بزرگ‌مردی و ایثار، درس‌های جاودانه‌ای برای بشریت شد.\r\n\r\nبهترین توصیف این بزرگواران عالم اسلام را باید در کلام معلمان بشریت، یعنی اهل بیت علیهم‌السلام جستجو کرد. ائمه معصومین علیهم‌السلام با بیان جایگاه و فضایل این شخصیت‌های برجسته، درس‌های عمیقی برای انسان‌ها به یادگار گذاشته‌اند. امام صادق علیه‌السلام در زیارتنامه‌ای که در حق حضرت عباس علیه‌السلام صادر فرمودند، با جمله کوتاه اما پرمعنای «أَشْهَدُ أَنَّكَ لَمْ تَهِنْ وَ لَمْ تَنْكُلْ وَ أَنَّكَ مَضَیْتَ عَلىٰ بَصِیرَةٍ مِنْ أَمْرِكَ» (گواهی می‌دهم که هرگز سست نشدی و عقب ننشستی بلکه با بصیرت نسبت به امر و وظیفه‌ات روزگارت را سپری کردی)، شجاعت، استقامت و وفاداری بی‌بدیل ایشان را به تصویر کشیدند. این عبارت، بیانگر عظمت روحی و ایمان راسخ حضرت عباس علیه‌السلام در راه دفاع از حق و حقیقت است.\r\nاین عبارت پر مغز  درس‌های بزرگی برای همه انسان‌ها، به ویژه پیروان راه حق، در بر دارد و به ما می‌آموزد که در مسیر یاری حق و جهاد در راه خدا، هرگز نباید سست شد و از موضع خود عقب‌نشینی کرد. همچنین این فراز از جمله‌ی امام صادق علیه‌السلام به ما یادآوری می‌کند که در برابر مشکلات و سختی‌ها، باید با بصیرت و استقامت حرکت کرد. بصیرت به معنای شناخت درست راه و تشخیص حق از باطل است و استقامت به معنای پایداری و مقاومت در برابر تمام موانع و فشارها. حضرت عباس علیه‌السلام با وجود تمام مصائب و خطرات، هرگز از حمایت از امام زمانش، امام حسین علیه‌السلام، دست برنداشت و تا آخرین لحظه، وفاداری و شجاعت خود را حفظ کرد.\r\n\r\nدر زندگی امروز نیز، این درس‌ها برای ما کاربرد دارد. در مسیر دفاع از حق و عدالت، چه در عرصه‌های فردی و چه اجتماعی، باید از سستی و ترس دوری کرد و با ایمان و اراده‌ای قوی، در راه اهداف والای الهی گام برداشت. یاد و راه حضرت عباس علیه‌السلام به ما می‌آموزد که پیروزی نهایی از آنِ کسانی است که در راه حق، استوار و مقاوم می‌مانند و هرگز از اصول خود عدول نمی‌کنند.\r\n', 1, '', 0, 'https://newsmedia.tasnimnews.com/Tasnim/Uploaded/Image/1403/11/15/1403111510391620732053244.png');

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `role_id` int(11) NOT NULL,
  `role_name` varchar(45) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `user_name` varchar(45) NOT NULL,
  `user_email` varchar(45) NOT NULL,
  `user_password` varchar(100) NOT NULL,
  `on_newsletter` varchar(4) NOT NULL,
  `user_role` int(10) NOT NULL,
  `is_deleted` char(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `user_name`, `user_email`, `user_password`, `on_newsletter`, `user_role`, `is_deleted`) VALUES
(1, 'mr.lhlgl', 'jalebseore20@gmail.com', '123456', '', 0, ''),
(2, 'sfsdfs', 'sdfsdfds@sdfs.ir', '123456', '', 0, ''),
(3, 'fff', 'sdfsdfds@sdfs.ir', '1234', '', 0, ''),
(5, 'fff', 'dsjsfjldsjflds@gmail.com', '33', '', 0, ''),
(6, 'hhhh', 'lkjlkjlk@mfglfg', '12', '', 0, '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`news_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `news_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
